In [1]:

import pandas as pd
import matplotlib.pyplot as plt 
import seaborn as sns

from sklearn.preprocessing import LabelEncoder
from sklearn.model_selection import train_test_split
from sklearn.naive_bayes import BernoulliNB
from sklearn.metrics import accuracy_score,confusion_matrix


import warnings
warnings.filterwarnings('ignore')

In [2]:
data = pd.read_csv('train.csv')
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
data.drop(columns=['PassengerId','Name','Ticket','Cabin'],axis=1,inplace=True)
data.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [7]:
Le = LabelEncoder()
data.Sex = Le.fit_transform(data['Sex'])
data.Embarked = Le.fit_transform(data['Embarked'])

In [8]:

data.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0         0       3    1  22.0      1      0   7.2500         2
1         1       1    0  38.0      1      0  71.2833         0
2         1       3    0  26.0      0      0   7.9250         2
3         1       1    0  35.0      1      0  53.1000         2
4         0       3    1  35.0      0      0   8.0500         2

In [5]:
X = data.drop(["Survived"],axis = 1)

In [9]:

y = data["Survived"]

In [10]:
X_train,X_test,y_train,y_test = train_test_split(X,y, test_size=0.2,random_state=3,)

In [11]:
X_train.head()

     Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
287       2    1  42.0      0      0  13.0000         2
735       3    0  48.0      1      3  34.3750         2
857       3    1  45.0      0      0   7.2292         0
591       3    1  47.0      0      0   7.2500         2
524       3    1  40.5      0      0   7.7500         1

In [12]:

y_train.head()

287    1
735    0
857    0
591    0
524    0
Name: Survived, dtype: int64

In [28]:
clf = BernoulliNB()
clf.fit(X_train,y_train)

BernoulliNB(alpha=1.0, binarize=0.0, class_prior=None, fit_prior=True)

In [29]:

x = clf.predict(X_test)

In [32]:
accuracy_score(y_test,x,normalize=True)

0.797752808988764

In [33]:
confusion_matrix(y_test,x)

array([[101,   9],
       [ 27,  41]], dtype=int64)